--[[

 ██▓███   ██▀███   ▒█████  ▄▄▄█████▓ ▒█████   ███▄    █ 
▓██░  ██▒▓██ ▒ ██▒▒██▒  ██▒▓  ██▒ ▓▒▒██▒  ██▒ ██ ▀█   █
▓██░ ██▓▒▓██ ░▄█ ▒▒██░  ██▒▒ ▓██░ ▒░▒██░  ██▒▓██  ▀█ ██▒
▒██▄█▓▒ ▒▒██▀▀█▄  ▒██   ██░░ ▓██▓ ░ ▒██   ██░▓██▒  ▐▌██▒
▒██▒ ░  ░░██▓ ▒██▒░ ████▓▒░  ▒██▒ ░ ░ ████▓▒░▒██░   ▓██░
▒▓▒░ ░  ░░ ▒▓ ░▒▓░░ ▒░▒░▒░   ▒ ░░   ░ ▒░▒░▒░ ░ ▒░   ▒ ▒
░▒ ░       ░▒ ░ ▒░  ░ ▒ ▒░     ░      ░ ▒ ▒░ ░ ░░   ░ ▒░
░░         ░░   ░ ░ ░ ░ ▒    ░      ░ ░ ░ ▒     ░   ░ ░
            ░         ░ ░               ░ ░           ░

                        UI Library

		Source code:
		 • https://github.com/ayvacs/Proton
		
		Written by:
		 • ayvacs :)
		 • eLi
		
		License:
		 • https://github.com/ayvacs/Proton/blob/main/LICENSE.md
]]


local Functions = script.Functions

return {
	License = require(script.License),
	Version = require(script.Version),

	new = require(Functions.new)
}